Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.Select Method
 Selects an analysis model. Updates the model. The AnalysisModelName or ID has to be set.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override void Select()
Public Overrides Sub Select
See Also
Reference
AnalysisModel Class
Select Overload
Tekla.Structures.Analysis Namespace